klaslofstedt/stm32f4_quadcopter/user/src/imu.c
#include <stdlib.h>

/* Scheduler include files. */
#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
#include "semphr.h"
#include "queue.h"

/* Demo program include files. */
#include "uart.h"
#include "freertos_time.h"
#include "imu.h"
#include "debug.h"
#include "board.h"

// dmp
#include "inv_mpu.h"
#include "inv_mpu_dmp_motion_driver.h"
#include "invensense.h"
#include "invensense_adv.h"
#include "eMPL_outputs.h"
#include "mltypes.h"
#include "mpu.h"

#include "stm32f4xx.h"
#include "stm32f4xx_conf.h"
#include "stm32f4xx_it.h"
//#include "log.h"
//#include "packet.h"

#define ACCEL_ON        (0x01)
#define GYRO_ON         (0x02)
#define COMPASS_ON      (0x04)

#define MOTION          (0)
#define NO_MOTION       (1)

/* Starting sampling rate. */
#define DEFAULT_MPU_HZ  (200) // Change this to 200

#define FLASH_SIZE      (512)
#define FLASH_MEM_START ((void*)0x1800)

#define PEDO_READ_MS    (1000)
#define TEMP_READ_MS    (500)
#define COMPASS_READ_MS (100)

static void gpio_init(void);

xSemaphoreHandle imu_attitude_sem = NULL;
xSemaphoreHandle imu_altitude_sem = NULL;

xQueueHandle imu_attitude_queue = 0;
xQueueHandle imu_altitude_queue = 0;


imu_data_t imu = {
    .dmp_roll = 0,
    .dmp_pitch = 0,
    .dmp_yaw = 0,
    .gyro_roll = 0,
    .gyro_pitch = 0,
    .gyro_yaw = 0,
    .acc_x = 0,
    .acc_y = 0,
    .acc_z = 0,
    .dt = 0,
    .stack_size = 0
};

volatile uint32_t hal_timestamp = 0;


struct rx_s {
    unsigned char header[3];
    unsigned char cmd;
};
struct hal_s {
    unsigned char lp_accel_mode;
    unsigned char sensors;
    unsigned char dmp_on;
    unsigned char wait_for_tap;
    volatile unsigned char new_gyro;
    unsigned char motion_int_mode;
    unsigned long no_dmp_hz;
    unsigned long next_pedo_ms;
    unsigned long next_temp_ms;
    unsigned long next_compass_ms;
    unsigned int report;
    unsigned short dmp_features;
    struct rx_s rx;
};
static struct hal_s hal = {0};



/* USB RX binary semaphore. Actually, it's just a flag. Not included in struct
* because it's declared extern elsewhere.
*/
volatile unsigned char rx_new;

unsigned char *mpl_key = (unsigned char*)"eMPL 5.1";

/* Platform-specific information. Kinda like a boardfile. */
struct platform_data_s {
    signed char orientation[9];
};

/* The sensors can be mounted onto the board in any orientation. The mounting
* matrix seen below tells the MPL how to rotate the raw data from the
* driver(s).
* TODO: The following matrices refer to the configuration on internal test
* boards at Invensense. If needed, please modify the matrices to match the
* chip-to-body matrix for your particular set up.
*/
static struct platform_data_s gyro_pdata = {
    .orientation = { 1, 0, 0,
    0, 1, 0,
    0, 0, 1}
};

#if defined MPU9150 || defined MPU9250
static struct platform_data_s compass_pdata = {
    .orientation = { 0, 1, 0,
    1, 0, 0,
    0, 0, -1}
};
#define COMPASS_ENABLED 1
#elif defined AK8975_SECONDARY
static struct platform_data_s compass_pdata = {
    .orientation = {-1, 0, 0,
    0, 1, 0,
    0, 0,-1}
};
#define COMPASS_ENABLED 1
#elif defined AK8963_SECONDARY
static struct platform_data_s compass_pdata = {
    .orientation = {-1, 0, 0,
    0,-1, 0,
    0, 0, 1}
};
#define COMPASS_ENABLED 1
#endif

void gpio_init(void)
{
    
    GPIO_InitTypeDef   GPIO_InitStructure;
    NVIC_InitTypeDef   NVIC_InitStructure;
    EXTI_InitTypeDef   EXTI_InitStructure;
    
    //  GPIO_DeInit(GPIOA);
    //  GPIO_DeInit(GPIOC);
    
    /* Enable GPIOB clock */
    RCC_AHB1PeriphClockCmd(INVEN_INT_GPIO_CLK, ENABLE);
    /* Enable SYSCFG clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
    
    /* Configure invensense sensor interrupt pin as input floating */
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
    GPIO_InitStructure.GPIO_Pin = INVEN_INT_PIN;
    GPIO_Init(INVEN_INT_GPIO_PORT, &GPIO_InitStructure); //GPIOA
    
    /* Connect EXTI Line to inv sensor interrupt pin */
    SYSCFG_EXTILineConfig(INVEN_INT_EXTI_PORT, INVEN_INT_EXTI_PIN);
    
    /* Configure EXTI Line1 */
    EXTI_InitStructure.EXTI_Line = INVEN_INT_EXTI_LINE;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;  
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
    
    /* Enable and set EXTI Line Interrupt to the highest priority */
    NVIC_InitStructure.NVIC_IRQChannel = INVEN_INT_EXTI_IRQ;
    // http://www.freertos.org/RTOS-Cortex-M3-M4.html
    // configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY in FreeRTOSConfig.h
    // Should be lower (higher value) than configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 10; 
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 10; // prob dont need to be changed
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

void EnableInvInterrupt(void)
{
    EXTI_InitTypeDef   EXTI_InitStructure;
    /* Configure EXTI Line1 */
    EXTI_InitStructure.EXTI_Line = INVEN_INT_EXTI_LINE;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
}
void DisableInvInterrupt(void)
{
    EXTI_InitTypeDef   EXTI_InitStructure;
    /* Configure EXTI Line1 */
    EXTI_InitStructure.EXTI_Line = INVEN_INT_EXTI_LINE;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_LineCmd = DISABLE;
    EXTI_Init(&EXTI_InitStructure);
    EXTI_ClearITPendingBit(INVEN_INT_EXTI_LINE);
}

void InvIntHandler(void)
{
    /* Clear the EXTI line 1 pending bit */
    EXTI_ClearITPendingBit(INVEN_INT_EXTI_LINE);
}

void imu_read(imu_data_t* in)
{
    in->acc_x = imu.acc_x;
    in->acc_y = imu.acc_y;
    in->acc_z = imu.acc_z;
    in->gyro_roll = imu.gyro_roll;
    in->gyro_pitch = imu.gyro_pitch;
    in->gyro_yaw = imu.gyro_yaw;
    in->dmp_roll = imu.dmp_roll;
    in->dmp_pitch = imu.dmp_pitch;
    in->dmp_yaw = imu.dmp_yaw;
    in->dt = imu.dt;
}

float imu_read_acc_z(void)
{
    return -imu.acc_z;
}

float imu_read_dmp_roll(void)
{
    return imu.dmp_roll;
}

float imu_read_dmp_pitch(void)
{
    return imu.dmp_pitch;
}

float imu_acc_z_average(uint32_t samples)
{
    // You should probably wait 10 seconds for the sensor to stabilize
    uint32_t i;
    imu.acc_z_average = 0;
    for(i = 0; i < samples; i++){
        imu.acc_z_average += imu.acc_z / samples;
    }
    return imu.acc_z_average;
}

unsigned long ts2 = 0;
static void read_from_mpl_float(void)
{
    int8_t accuracy;
    unsigned long ts1 = 0;
    float data[3] = {0};
    
    if (inv_get_sensor_type_accel_float(data, &accuracy, (inv_time_t*)&ts1))
    {
        imu.acc_x = data[0];
        imu.acc_y = data[1];
        imu.acc_z = data[2];
    }
    
    if (inv_get_sensor_type_gyro_float(data, &accuracy, (inv_time_t*)&ts1))
    {
        imu.gyro_roll = data[0];
        imu.gyro_pitch = data[1];
        imu.gyro_yaw = data[2];
    }
    
    if (inv_get_sensor_type_euler_float(data, &accuracy, (inv_time_t*)&ts1))
    {
        imu.dmp_roll = data[0];
        imu.dmp_pitch = data[1];
        imu.dmp_yaw = data[2];
        imu.dt = ts1 - ts2;
        ts2 = ts1;
        
        
        /*if(!xQueueSend(imu_attitude_queue, &imu, 1000)){
        uart_printf("xQueueSend failed\n\r");
    }*/
        //uart_printf("xQueueOverwrite imu_attitude_queue\n\r");
        xQueueOverwrite(imu_attitude_queue, &imu);
        //xSemaphoreGive(imu_attitude_sem);
        xQueueOverwrite(imu_altitude_queue, &imu);
        //printf2(" roll: %7.4f", imu.gyro_roll);
        //printf2(" pitch: %7.4f\n\r", imu.gyro_pitch);
        // Send same data to altitude for futher calculations
        
        // Send attitude data to main
        /*if(!xQueueSend(imu_attitude_queue, &imu, 1000)){
        printf2("xQueueSend failed\n\r");
    }*/
        
        //xSemaphoreGive(imu_attitude_sem);
        
        
        //xSemaphoreGive(imu_altitude_sem);
        
        //taskYIELD();
    }
    else{
        uart_printf("dmp failed\n\r");
    }
    
