klaslofstedt/stm32f4_quadcopter/user/src/imu.c
}

#ifdef COMPASS_ENABLED
void send_status_compass() {
    long data[3] = { 0 };
    int8_t accuracy = { 0 };
    unsigned long timestamp;
    inv_get_compass_set(data, &accuracy, (inv_time_t*) &timestamp);
    uart_printf("Compass: %7.4f %7.4f %7.4f \n\r",
                data[0]/65536.f, data[1]/65536.f, data[2]/65536.f);
    uart_printf("Accuracy= %d\r\n", accuracy);
    
}
#endif

/* Handle sensor on/off combinations. */
static void setup_gyro(void)
{
    unsigned char mask = 0, lp_accel_was_on = 0;
    if (hal.sensors & ACCEL_ON)
        mask |= INV_XYZ_ACCEL;
    if (hal.sensors & GYRO_ON) {
        mask |= INV_XYZ_GYRO;
        lp_accel_was_on |= hal.lp_accel_mode;
    }
#ifdef COMPASS_ENABLED
    if (hal.sensors & COMPASS_ON) {
        mask |= INV_XYZ_COMPASS;
        lp_accel_was_on |= hal.lp_accel_mode;
    }
#endif
    /* If you need a power transition, this function should be called with a
    * mask of the sensors still enabled. The driver turns off any sensors
    * excluded from this mask.
    */
    mpu_set_sensors(mask);
    mpu_configure_fifo(mask);
    if (lp_accel_was_on) {
        unsigned short rate;
        hal.lp_accel_mode = 0;
        /* Switching out of LP accel, notify MPL of new accel sampling rate. */
        mpu_get_sample_rate(&rate);
        inv_set_accel_sample_rate(1000000L / rate);
    }
}



static inline void run_self_test(void)
{
    int result;
    long gyro[3], accel[3];
    
#if defined (MPU6500) || defined (MPU9250)
    result = mpu_run_6500_self_test(gyro, accel, 0);
#elif defined (MPU6050) || defined (MPU9150)
    result = mpu_run_self_test(gyro, accel);
#endif
    if (result == 0x7) {
        uart_printf("Self test passed2\n\r");
        /*printf2("accel: %7.4f %7.4f %7.4f\n\r",
        accel[0]/65536.f,
        accel[1]/65536.f,
        accel[2]/65536.f);
        printf2("gyro: %7.4f %7.4f %7.4f\n\r",
        gyro[0]/65536.f,
        gyro[1]/65536.f,
        gyro[2]/65536.f);*/
        /* Test passed. We can trust the gyro data here, so now we need to update calibrated data*/
        
#ifdef USE_CAL_HW_REGISTERS
        /*
        * This portion of the code uses the HW offset registers that are in the MPUxxxx devices
        * instead of pushing the cal data to the MPL software library
        */
        unsigned char i = 0;
        
        for(i = 0; i<3; i++) {
            gyro[i] = (long)(gyro[i] * 32.8f); //convert to +-1000dps
            accel[i] *= 2048.f; //convert to +-16G
            accel[i] = accel[i] >> 16;
            gyro[i] = (long)(gyro[i] >> 16);
        }
        
        mpu_set_gyro_bias_reg(gyro);
        
#if defined (MPU6500) || defined (MPU9250)
        mpu_set_accel_bias_6500_reg(accel);
#elif defined (MPU6050) || defined (MPU9150)
        mpu_set_accel_bias_6050_reg(accel);
#endif
#else
        /* Push the calibrated data to the MPL library.
        *
        * MPL expects biases in hardware units << 16, but self test returns
        * biases in g's << 16.
        */
        unsigned short accel_sens;
        float gyro_sens;
        
        mpu_get_accel_sens(&accel_sens);
        accel[0] *= accel_sens;
        accel[1] *= accel_sens;
        accel[2] *= accel_sens;
        inv_set_accel_bias(accel, 3);
        mpu_get_gyro_sens(&gyro_sens);
        gyro[0] = (long) (gyro[0] * gyro_sens);
        gyro[1] = (long) (gyro[1] * gyro_sens);
        gyro[2] = (long) (gyro[2] * gyro_sens);
        inv_set_gyro_bias(gyro, 3);
#endif
    }
    else {
        if (!(result & 0x1)){
            uart_printf("Gyro failed\n\r");
        } 
        if (!(result & 0x2)){
            uart_printf("Accel failed\n\r");
        }
        if (!(result & 0x4)){
            uart_printf("Compass failed\n\r");
        }
    }
}


/* Every time new gyro data is available, this function is called in an
* ISR context. In this example, it sets a flag protecting the FIFO read
* function.
*/

void gyro_data_ready_cb(void)
{
    /*portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
    
    xSemaphoreGiveFromISR(gyro_new, &xHigherPriorityTaskWoken);
    if (xHigherPriorityTaskWoken != pdFALSE) {
    portEND_SWITCHING_ISR(xHigherPriorityTaskWoken);
}*/
    //printf2("gyro\n\r");
    hal.new_gyro = 1;
}



void imu_task(void *pvParameters)
{
    //delay_ms(10000);
    UBaseType_t stack_size;
    stack_size = uxTaskGetStackHighWaterMark(NULL);
    uart_printf("imu task\n\r");
    gpio_init();
    
    imu_attitude_queue = xQueueCreate(1, sizeof(imu_data_t));
    imu_altitude_queue = xQueueCreate(1, sizeof(imu_data_t));
    
    vSemaphoreCreateBinary(gyro_new);
    vSemaphoreCreateBinary(imu_attitude_sem);
    vSemaphoreCreateBinary(imu_altitude_sem);
    
    //-------------------------------------dmp--------------------------
    // gör något åt hastigheten på loopen..? den verkar gå på 5-6 ms ~150-200 Hz
    inv_error_t result;
    
    unsigned char accel_fsr,  new_temp = 0;
    unsigned short gyro_rate, gyro_fsr;
    unsigned long timestamp;
    struct int_param_s int_param;
    
#ifdef COMPASS_ENABLED
    unsigned char new_compass = 0;
    unsigned short compass_fsr;
#endif
    
    result = mpu_init(&int_param);
    if (result) {
        uart_printf("Could not initialize gyro.\n\r");
    }
    result = inv_init_mpl();
    if (result) {
        uart_printf("Could not initialize MPL.\n\r");
    }
    /* Compute 6-axis and 9-axis quaternions. */
    inv_enable_quaternion();
    inv_enable_9x_sensor_fusion();
    /* The MPL expects compass data at a constant rate (matching the rate
    * passed to inv_set_compass_sample_rate). If this is an issue for your
    * application, call this function, and the MPL will depend on the
    * timestamps passed to inv_build_compass instead.
    *
    * inv_9x_fusion_use_timestamps(1);
    */
    
    /* This function has been deprecated.
    * inv_enable_no_gyro_fusion();
    */
    
    /* Update gyro biases when not in motion.
    * WARNING: These algorithms are mutually exclusive.
    */
    inv_enable_fast_nomot();
    /* inv_enable_motion_no_motion(); */
    /* inv_set_no_motion_time(1000); */
    
